---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarRoundingManager
source: html/db93e1af-7588-f7f9-b505-490979327dac.htm
---
# Autodesk.Revit.DB.Structure.RebarRoundingManager

Provides access to element reinforcement roundings overrides.

## Syntax (C#)
```csharp
public class RebarRoundingManager : ReinforcementRoundingManager
```

## Remarks
An instance of this class can be obtained from specific RebarTypes or individual Rebar or RebarInSystem elements to apply overrides different from the global settings for the project.